tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "gnutls"
brew "cask"
brew "docker"
brew "docker-compose"
brew "gcc"
brew "openjpeg"
brew "leptonica"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "git-flow-avh"
brew "graphviz"
brew "gyb"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "mas"
brew "midnight-commander"
brew "nmap"
brew "openjdk"
brew "openssh"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "postgresql@14", restart_service: true
brew "powerlevel10k"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "speedtest-cli"
brew "transmission-cli"
brew "typst"
brew "watch"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "alt-tab"
cask "bartender"
cask "cheatsheet"
cask "cleanmymac"
cask "discord"
cask "dotnet-sdk"
cask "drawio"
cask "dropbox"
cask "fig"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "github"
cask "gitkraken"
cask "grammarly"
cask "grandperspective"
cask "handbrake"
cask "iterm2"
cask "jetbrains-toolbox"
cask "logi-options-plus"
cask "logitech-presentation"
cask "logitune"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mongodb-compass"
cask "mono-mdk-for-visual-studio"
cask "nvidia-geforce-now"
cask "obsidian"
cask "pdf-expert"
cask "pgadmin4"
cask "popclip"
cask "readdle-spark"
cask "rocket"
cask "sf-symbols"
cask "ssh-config-editor"
cask "teamviewer"
cask "tower"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Disk Speed Test", id: 425264550
mas "Easy CSV Editor", id: 1171346381
mas "Gemini 2", id: 1090488118
mas "Grammarly for Safari", id: 1462114288
mas "iNet Network Scanner", id: 403304796
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OmniPlan", id: 1460319993
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Speedtest", id: 1153157709
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "Texifier", id: 458866234
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "TimeStory", id: 1470702823
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "andi1984.tinypng"
vscode "andyyaldoo.vscode-json"
vscode "britesnow.vscode-toggle-quotes"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "docsmsft.docs-markdown"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "ionide.ionide-fsharp"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jerryhong.autofilename"
vscode "jmrog.vscode-nuget-package-manager"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kishoreithadi.dotnet-core-essentials"
vscode "liamhammett.inline-parameters"
vscode "mdk.vega-preview"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "patcx.vscode-nuget-gallery"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reflectiondm.classynaming"
vscode "richie5um2.vscode-sort-json"
vscode "sidiandi.plantuml-sidiandi-fork"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "tintoy.msbuild-project-tools"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
vscode "znck.grammarly"
