tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.9"
brew "gnutls"
brew "cask"
brew "docker"
brew "docker-compose"
brew "openjpeg"
brew "leptonica"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "python@3.11"
brew "gyb"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "mas"
brew "midnight-commander"
brew "nmap"
brew "openssh"
brew "pgcli"
brew "pgformatter"
brew "postgresql@14"
brew "powerlevel10k"
brew "python@3.10"
brew "speedtest-cli"
brew "transmission-cli"
brew "watch"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "aldente"
cask "alt-tab"
cask "bartender"
cask "cheatsheet"
cask "cleanmymac"
cask "customshortcuts"
cask "discord"
cask "dotnet-sdk"
cask "drawio"
cask "dropbox"
cask "fig"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "gitkraken"
cask "google-chrome"
cask "grammarly"
cask "handbrake"
cask "jetbrains-toolbox"
cask "logitech-options"
cask "logitech-presentation"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mimestream"
cask "mongodb-compass"
cask "monitorcontrol"
cask "mono-mdk-for-visual-studio"
cask "netspot"
cask "nvidia-geforce-now"
cask "pdf-expert"
cask "postman"
cask "raycast"
cask "readdle-spark"
cask "rode-connect"
cask "sf-symbols"
cask "shottr"
cask "spotify"
cask "ssh-config-editor"
cask "steam"
cask "teamviewer"
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "AngryBirdsReloaded", id: 1539172625
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Easy CSV Editor", id: 1171346381
mas "Gemini 2", id: 1090488118
mas "Grammarly for Safari", id: 1462114288
mas "iNet Network Scanner", id: 403304796
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Mini Motorways", id: 1456188526
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OmniPlan", id: 1460319993
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Speedtest", id: 1153157709
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "Texifier", id: 458866234
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WireGuard", id: 1451685025
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "andi1984.tinypng"
vscode "andyyaldoo.vscode-json"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "docsmsft.docs-markdown"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Fudge.auto-using"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "IBM.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "Ionide.Ionide-fsharp"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "JerryHong.autofilename"
vscode "jmrog.vscode-nuget-package-manager"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "KishoreIthadi.dotnet-core-essentials"
vscode "liamhammett.inline-parameters"
vscode "mdk.vega-preview"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "patcx.vscode-nuget-gallery"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "reflectiondm.classynaming"
vscode "richie5um2.vscode-sort-json"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "tintoy.msbuild-project-tools"
vscode "tomoki1207.pdf"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
vscode "znck.grammarly"
