brew "jpeg-xl"
brew "webp"
brew "aom"
brew "python@3.13"
brew "asitop"
brew "ata"
brew "dotnet"
brew "ffmpeg"
brew "fzf"
brew "fzf-tab"
brew "gemini-cli"
brew "gh"
brew "openjpeg"
brew "leptonica"
brew "ghostscript"
brew "git"
brew "gnutls"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "just"
brew "mactop"
brew "mas"
brew "mpv"
brew "utf8proc"
brew "neovim"
brew "nmap"
brew "ollama"
brew "openjdk"
brew "openssh"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "podman-compose"
brew "starship"
brew "transmission-cli"
brew "tree"
brew "typst"
brew "watch"
brew "wifi-password"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
cask "1password"
cask "1password-cli"
cask "affine"
cask "bambu-studio"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "cleanshot"
cask "discord"
cask "dockdoor"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "gitkraken"
cask "google-drive"
cask "grammarly-desktop"
cask "grandperspective"
cask "handbrake-app"
cask "iina"
cask "iterm2"
cask "linearmouse"
cask "lm-studio"
cask "notion"
cask "obsidian"
cask "pdf-expert"
cask "podman-desktop"
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-pass"
cask "protonvpn"
cask "rectangle-pro"
cask "signal"
cask "teamviewer"
cask "texifier"
cask "tower"
cask "transmission"
cask "upscayl"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "DaisyDisk", id: 411643860
mas "Easy CSV Editor", id: 1171346381
mas "Folder Preview", id: 6698876601
mas "Grammarly for Safari", id: 1462114288
mas "JSON Editor", id: 567740330
mas "LibreOffice", id: 1630474372
mas "LocalSend", id: 1661733229
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "MindNode Classic", id: 1289197285
mas "Noir", id: 1592917505
mas "OmniGraffle", id: 1142578753
mas "Parcel", id: 375589283
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "PLIST Editor", id: 1157491961
mas "Qwant for Safari", id: 1645050159
mas "Reeder", id: 6475002485
mas "SSH Config Editor", id: 1109319285
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "Texifier - App Store", id: 458866234
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
