brew "jpeg-xl"
brew "webp"
brew "aom"
brew "python@3.13"
brew "asitop"
brew "ata"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "geometry"
brew "gh"
brew "openjpeg"
brew "leptonica"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "gnutls"
brew "librsvg"
brew "graphviz"
brew "fzf"
brew "fzf-tab"
brew "gyb"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "just"
brew "mactop"
brew "mas"
brew "media-info"
brew "midnight-commander"
brew "yt-dlp"
brew "mpv"
brew "utf8proc", args: ["HEAD"]
brew "neovim"
brew "nmap"
brew "openssh"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "tree"
brew "watch"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
cask "1password-cli"
cask "codex"
cask "downie"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "gitkraken"
cask "grandperspective"
cask "handbrake-app"
cask "iterm2"
cask "linearmouse"
cask "pearcleaner"
cask "teamviewer"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Easy CSV Editor", id: 1171346381
mas "JSON Editor", id: 567740330
mas "OpenSpeedTest-Server", id: 1579499874
mas "Paste", id: 967805235
mas "PLIST Editor", id: 1157491961
mas "Remote Desktop Scanner", id: 1605485521
mas "Speedtest", id: 1153157709
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "The Unarchiver", id: 425424353
mas "Transloader", id: 572281534
vscode "aaron-bond.better-comments"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "bradymholt.pgformatter"
vscode "britesnow.vscode-toggle-quotes"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "ionide.ionide-fsharp"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jerryhong.autofilename"
vscode "jmrog.vscode-nuget-package-manager"
vscode "liamhammett.inline-parameters"
vscode "marp-team.marp-vscode"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "orangex4.vscode-typst-sync"
vscode "patcx.vscode-nuget-gallery"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "reflectiondm.classynaming"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "s3anmorrow.openwithkraken"
vscode "sidiandi.plantuml-sidiandi-fork"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "surv.typst-math"
vscode "tintoy.msbuild-project-tools"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"
