tap "joshmedeski/sesh"
tap "mongodb/brew"
brew "jpeg-xl"
brew "aom"
brew "asitop"
brew "ata"
brew "bat"
brew "butane"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "fzf-tab"
brew "webp"
brew "gh"
brew "openjpeg"
brew "leptonica"
brew "ghostscript"
brew "git"
brew "gnutls"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "just"
brew "lazygit"
brew "librdkafka"
brew "mactop"
brew "marp-cli"
brew "mas"
brew "uchardet"
brew "yt-dlp"
brew "mpv"
brew "utf8proc"
brew "neovim"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "postgresql@17"
brew "sesh"
brew "starship"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "typst"
brew "unar"
brew "watch"
brew "wifi-password"
brew "ykman"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "mongodb/brew/mongodb-community"
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "cleanshot"
cask "discord"
cask "dockdoor"
cask "dotnet-sdk"
cask "downie"
cask "drawio"
cask "font-carlito"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-roboto"
cask "font-source-sans-3"
cask "forklift"
cask "gitkraken"
cask "gitkraken-cli"
cask "grandperspective"
cask "handbrake-app"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyclu"
cask "latest"
cask "linearmouse"
cask "logitech-g-hub"
cask "mactex"
cask "macwhisper"
cask "microsoft-teams"
cask "mission-control-plus"
cask "mongodb-compass"
cask "nextcloud"
cask "obsidian"
cask "ollama-app"
cask "pdf-expert"
cask "pearcleaner"
cask "podman-desktop"
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "protonvpn"
cask "raycast"
cask "signal"
cask "steam"
cask "tableplus"
cask "teamviewer"
cask "texifier"
cask "transmission"
cask "visual-studio-code"
cask "warp"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Base", id: 6744867438
mas "Bear", id: 1091189122
mas "ClickClack", id: 6740695697
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "DaisyDisk", id: 411643860
mas "Draw Things", id: 6444050820
mas "Easy CSV Editor", id: 1171346381
mas "Final Cut Pro", id: 424389933
mas "Folder Preview", id: 6698876601
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "JSON Editor", id: 567740330
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "Magnet", id: 441258766
mas "Markdown Preview", id: 6739955340
mas "Mela", id: 1568924476
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode Classic", id: 1289197285
mas "Native SQLite Manager", id: 1416282836
mas "Noir", id: 1592917505
mas "OmniGraffle", id: 1142578753
mas "Open Markdown", id: 6758868093
mas "Parcel", id: 375589283
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Photomator", id: 1444636541
mas "PixelColorPick", id: 6754412788
mas "Pixelmator Pro", id: 1289583905
mas "PixelsMeasure", id: 1638740542
mas "PLIST Editor", id: 1157491961
mas "Postico", id: 6446933691
mas "Reeder", id: 6475002485
mas "Shazam", id: 897118787
mas "SSH Config Editor", id: 1109319285
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "Texifier 2", id: 458866234
mas "The Unarchiver", id: 425424353
mas "TimeStory", id: 1470702823
mas "Transloader", id: 572281534
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "bradymholt.pgformatter"
vscode "britesnow.vscode-toggle-quotes"
vscode "chrischinchilla.vscode-pandoc"
vscode "codesmith.markdown-inline-editor-vscode"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "huacat.office-theme"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jerryhong.autofilename"
vscode "liamhammett.inline-parameters"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "myriad-dreamin.tinymist"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "slashmd.slashmd"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
