tap "homebrew/bundle"
tap "homebrew/services"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asitop"
brew "ata"
brew "gnutls"
brew "cask"
brew "docker"
brew "openjpeg"
brew "leptonica"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "geometry"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "librsvg"
brew "graphviz"
brew "gyb"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "mactop"
brew "mas"
brew "midnight-commander"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "nmap"
brew "ollama"
brew "openjdk"
brew "openssh"
brew "pandoc"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "powerlevel10k"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "transmission-cli"
brew "tree"
brew "typst"
brew "utf8proc", args: ["HEAD"]
brew "watch"
brew "wifi-password"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "amazon-q"
cask "bartender"
cask "chatgpt"
cask "cleanmymac"
cask "cleanshot"
cask "diffusionbee"
cask "discord"
cask "dotnet-sdk"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "github"
cask "gitkraken"
cask "grandperspective"
cask "handbrake"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "linearmouse"
cask "lm-studio"
cask "logi-options+"
cask "mactex"
cask "macwhisper"
cask "microsoft-edge"
cask "microsoft-teams"
cask "miro"
cask "mongodb-compass"
cask "obsidian"
cask "pdf-expert"
cask "pgadmin4"
cask "raycast"
cask "readdle-spark"
cask "setapp"
cask "teamviewer"
cask "texifier"
cask "tower"
cask "visual-studio-code"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "Disk Speed Test", id: 425264550
mas "Easy CSV Editor", id: 1171346381
mas "Gemini 2", id: 1090488118
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "iNet Network Scanner", id: 403304796
mas "JSON Editor", id: 567740330
mas "Keynote", id: 409183694
mas "Lockera Widgets", id: 6466819847
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "MenuBar Stats", id: 714196447
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "PLIST Editor", id: 1157491961
mas "Postico", id: 6446933691
mas "Reeder", id: 1529448980
mas "Speedtest", id: 1153157709
mas "SSH Config Editor", id: 1109319285
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "TimeStory", id: 1470702823
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "be5invis.toml"
vscode "bradymholt.pgformatter"
vscode "britesnow.vscode-toggle-quotes"
vscode "chrischinchilla.vscode-pandoc"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "docsmsft.docs-markdown"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "ionide.ionide-fsharp"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jerryhong.autofilename"
vscode "jmrog.vscode-nuget-package-manager"
vscode "liamhammett.inline-parameters"
vscode "mechatroner.rainbow-csv"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.openai-chatgpt-adhoc"
vscode "orangex4.vscode-typst-sync"
vscode "patcx.vscode-nuget-gallery"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "reflectiondm.classynaming"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "s3anmorrow.openwithkraken"
vscode "sidiandi.plantuml-sidiandi-fork"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "surv.typst-math"
vscode "tintoy.msbuild-project-tools"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
