# Userspace packages for chronos-redux (Bazzite, on bazzite-nvidia-custom image).
# rpm-ostree layered packages, custom RPM repos, and GNOME extensions live in
# install-bazzite.sh and lib/ — this Brewfile only describes what brew bundle
# can install on its own (formulae, casks, taps, and Flatpaks via the
# brew-bundle Flatpak directive).
#
# Some entries here ALSO ship in the bazzite-custom image as Fedora RPMs
# (bat, btop, eza, fzf, htop, jq, just, lazygit, starship, tmux, zoxide,
# zsh-autosuggestions, zsh-syntax-highlighting, font-symbols-only-nerd-font).
# Listing them here too is intentional — the zshrc.template's aliases (eza
# for ls, bat for fzf preview, etc.) and key bindings (fzf Ctrl+R, zoxide
# init) need them present whether or not the image is in use. Stock-Bazzite
# users should get a fully working shell from `just zsh` + `brew bundle`
# alone; image-rebased machines just have harmless duplicates (brew copy
# wins in PATH ordering after brew shellenv). Listing here also keeps
# `just drift` and `just prune` consistent — without it, prune would
# remove brew copies and `just zsh` would re-install them in a loop.
# The 33 image-preinstalled flatpaks are listed for the same reason
# (canonical "this machine wants this" record).
#
# Refresh with: just backup chronos-redux  (then hand-edit before commit —
# the dump pulls in default GNOME flatpaks that ship with Bazzite).

tap "joshmedeski/sesh"
tap "ublue-os/tap"
tap "colindean/fonts-nonfree"

# Shell + CLI
brew "bat"
brew "btop"
brew "butane"
brew "dotnet"
brew "eza"
brew "fzf"
brew "fzf-tab"
brew "htop"
brew "jq"
brew "just"
brew "lazygit"
brew "sesh"
brew "starship"
brew "tmux"
brew "typst"
brew "zoxide"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-autopair"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-you-should-use"

# GUI / desktop apps
cask "claude-code"
cask "ublue-os/tap/visual-studio-code-linux"
# 1Password GUI — uBlue tap (PR #296 automates setgid + native messaging
# manifests + custom_allowed_browsers, which were the integration pain
# points when we tried baking 1P into the image). The op CLI is not
# bundled by this cask and brew's separate `op` formula doesn't talk to
# the GUI (ublue-os/homebrew-tap#208) — left out intentionally.
cask "ublue-os/tap/1password-gui-linux"

# Fonts (Nerd Font set used by Ptyxis + Starship symbols)
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

# Document-compatibility fonts (Microsoft Office, classic web typefaces).
# colindean/fonts-nonfree provides the EULA-restricted MS faces.
cask "font-microsoft-office"
cask "font-microsoft-aptos"
cask "font-arial"
cask "font-arial-black"
cask "font-courier-new"
cask "font-times-new-roman"
cask "font-georgia"

# Flatpaks
flatpak "com.bilingify.readest"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.nextcloud.desktopclient.nextcloud"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.dergs.Tonearm"
flatpak "fr.handbrake.ghb"
flatpak "io.github.alainm23.planify"
flatpak "io.github.fabrialberio.pinapp"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.wartybix.Constrict"
flatpak "io.gitlab.adhami3310.Converter"
flatpak "io.gitlab.news_flash.NewsFlash"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.freedesktop.Piper"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.baobab"
flatpak "org.gnome.Boxes"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.signal.Signal"
flatpak "org.zotero.Zotero"
flatpak "rocks.shy.VacuumTube"
flatpak "com.ranfdev.DistroShelf"
flatpak "org.gnome.Epiphany"
brew "jpeg-turbo"
brew "jasper"
brew "libpng"
brew "libicns"
