tap "ublue-os/tap"
tap "colindean/fonts-nonfree"
tap "jakobhviid/tap"
brew "jakobhviid/tap/pwtune"
brew "jakobhviid/tap/amdl"
brew "bat"
brew "dotnet"
brew "eza"
brew "fzf"
brew "fzf-tab"
brew "jq"
brew "lazygit"
brew "sesh"
brew "starship"
brew "tmux"
brew "typst"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
cask "claude-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-microsoft-office"
cask "font-microsoft-aptos"
cask "font-arial"
cask "font-arial-black"
cask "font-courier-new"
cask "font-times-new-roman"
cask "font-georgia"
cask "ublue-os/tap/visual-studio-code-linux"
flatpak "be.alexandervanhee.gradia"
flatpak "com.bilingify.readest"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.nextcloud.desktopclient.nextcloud"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.dergs.Tonearm"
flatpak "fr.handbrake.ghb"
flatpak "io.github.alainm23.planify"
flatpak "io.github.cleomenezesjr.aurea"
flatpak "io.github.fabrialberio.pinapp"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.qwersyk.Newelle"
flatpak "io.github.seadve.Mousai"
flatpak "io.github.shonebinu.Brief"
flatpak "io.github.sitraorg.sitra"
flatpak "io.github.wartybix.Constrict"
flatpak "io.gitlab.adhami3310.Converter"
flatpak "io.gitlab.news_flash.NewsFlash"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "md.obsidian.Obsidian"
flatpak "net.trowell.typesetter"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.freedesktop.Piper"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.Epiphany"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.signal.Signal"
flatpak "org.zotero.Zotero"
flatpak "rocks.shy.VacuumTube"
cask "1password-gui-linux"
brew "lz4"
brew "zstd"
brew "binutils"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "btop"
brew "butane"
brew "gh"
brew "lm-sensors"
brew "htop"
brew "just"
brew "jpeg-turbo"
brew "jasper"
brew "libpng"
brew "libicns"
flatpak "dev.zed.Zed"
flatpak "com.rustdesk.RustDesk"
flatpak "io.github.idevecore.Valuta"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "org.kde.kdenlive"
flatpak "com.jeffser.Nocturne"
flatpak "de.capypara.FieldMonitor"
flatpak "io.m51.Gelly"
flatpak "org.gnome.Connections"
flatpak "org.jeffvli.feishin"
flatpak "org.musicbrainz.Picard"
flatpak "se.sjoerd.Graphs"
flatpak "io.github.anil_e.Codd"
flatpak "io.github.benjamimgois.goverlay"
flatpak "io.github.finefindus.Hieroglyphic"
flatpak "me.iepure.devtoolbox"
flatpak "org.darktable.Darktable"
flatpak "org.gnome.World.Citations"
brew "fmt"
brew "ada-url"
brew "alsa-lib"
brew "libvmaf"
brew "aom"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "libffi"
brew "libxcrypt"
brew "mpdecimal"
brew "readline"
brew "sqlite"
brew "unzip"
brew "util-linux"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "certifi"
brew "dav1d"
brew "libogg"
brew "flac"
brew "mpg123"
brew "lame"
brew "libcap"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsoxr"
brew "m4"
brew "libtool"
brew "libvpx"
brew "libxfixes"
brew "libxcursor"
brew "libxi"
brew "libxml2"
brew "libxrandr"
brew "libxscrnsaver"
brew "orc"
brew "speexdsp"
brew "pulseaudio"
brew "libice"
brew "libxinerama"
brew "libxxf86vm"
brew "xinput"
brew "sdl3"
brew "sdl2-compat"
brew "svt-av1"
brew "x264"
brew "x265"
brew "ffmpeg"
brew "fribidi"
brew "giflib"
brew "graphite2"
brew "harfbuzz"
brew "libavif"
brew "libimagequant"
brew "libraqm"
brew "libtiff"
brew "libyaml"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "pillow"
brew "gamdl"
brew "hdrhistogram_c"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libuv"
brew "simdutf"
brew "merve"
brew "nbytes"
brew "simdjson"
brew "uvwasi"
brew "node"
brew "ripgrep"
brew "opencode"
flatpak "ai.lmstudio.lm-studio"
flatpak "com.cassidyjames.dippi"
flatpak "com.github.marktext.marktext"
flatpak "com.openwebui.open-webui"
flatpak "de.hummdudel.Libellus"
flatpak "org.onlyoffice.desktopeditors"
flatpak "io.podman_desktop.PodmanDesktop"
