tap "joshmedeski/sesh"
tap "ublue-os/tap"
tap "colindean/fonts-nonfree"
brew "bat"
brew "dotnet"
brew "eza"
brew "fzf"
brew "fzf-tab"
brew "jq"
brew "lazygit"
brew "sesh"
brew "starship"
brew "tmux"
brew "typst"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
cask "claude-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-microsoft-office"
cask "font-microsoft-aptos"
cask "font-arial"
cask "font-arial-black"
cask "font-courier-new"
cask "font-times-new-roman"
cask "font-georgia"
cask "ublue-os/tap/visual-studio-code-linux"
flatpak "be.alexandervanhee.gradia"
flatpak "com.bilingify.readest"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.nextcloud.desktopclient.nextcloud"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.dergs.Tonearm"
flatpak "fr.handbrake.ghb"
flatpak "io.github.alainm23.planify"
flatpak "io.github.cleomenezesjr.aurea"
flatpak "io.github.fabrialberio.pinapp"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.qwersyk.Newelle"
flatpak "io.github.seadve.Mousai"
flatpak "io.github.shonebinu.Brief"
flatpak "io.github.sitraorg.sitra"
flatpak "io.github.wartybix.Constrict"
flatpak "io.gitlab.adhami3310.Converter"
flatpak "io.gitlab.news_flash.NewsFlash"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "md.obsidian.Obsidian"
flatpak "net.trowell.typesetter"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.freedesktop.Piper"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.Boxes"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.Epiphany"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.signal.Signal"
flatpak "org.zotero.Zotero"
flatpak "rocks.shy.VacuumTube"
cask "1password-gui-linux"
brew "lz4"
brew "zstd"
brew "binutils"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "btop"
brew "butane"
brew "gh"
brew "lm-sensors"
brew "htop"
brew "just"
