# Userspace packages for chronos-redux (Bazzite, on bazzite-nvidia-custom image).
# rpm-ostree layered packages, custom RPM repos, and GNOME extensions live in
# install-bazzite.sh and lib/ — this Brewfile only describes what brew bundle
# can install on its own (formulae, casks, taps, and Flatpaks via the
# brew-bundle Flatpak directive).
#
# After the bazzite-custom image rework, the CLI baseline (bat, btop, butane,
# eza, fzf, htop, jq, just, lazygit, starship, tmux, zoxide), zsh-autosuggestions,
# zsh-syntax-highlighting, and font-symbols-only-nerd-font are all in the image
# as RPMs — removed from this brewfile so brew doesn't install duplicates. The
# 33 image-preinstalled flatpaks (Discord, Signal, Nextcloud, LocalSend, etc.)
# are still listed here as the canonical "this machine wants this" record;
# `flatpak install` is idempotent so the duplication is harmless.
#
# Refresh with: just backup chronos-redux  (then hand-edit before commit —
# the dump pulls in default GNOME flatpaks that ship with Bazzite).

tap "joshmedeski/sesh"
tap "ublue-os/tap"

# Shell + CLI (only those NOT in the image)
brew "dotnet"
brew "fzf-tab"
brew "sesh"
brew "typst"

# Zsh plugins. zsh-autosuggestions and zsh-syntax-highlighting are also in
# the image as Fedora RPMs but kept here for stock-Bazzite compatibility +
# `just drift` consistency; on rebased machines they install as harmless
# duplicates and zshrc.template sources the image copy first. The other four
# stay brew-only — no Fedora packaging exists.
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-autopair"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-you-should-use"

# GUI / desktop apps
cask "claude-code"
cask "ublue-os/tap/visual-studio-code-linux"

# Fonts (image ships nerd-fonts (symbols-only); the patched typefaces aren't
# in F44 so they stay brew)
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Flatpaks
flatpak "com.bilingify.readest"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.nextcloud.desktopclient.nextcloud"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.dergs.Tonearm"
flatpak "fr.handbrake.ghb"
flatpak "io.github.alainm23.planify"
flatpak "io.github.fabrialberio.pinapp"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.wartybix.Constrict"
flatpak "io.gitlab.adhami3310.Converter"
flatpak "io.gitlab.news_flash.NewsFlash"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.freedesktop.Piper"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.baobab"
flatpak "org.gnome.Boxes"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.signal.Signal"
flatpak "org.zotero.Zotero"
flatpak "rocks.shy.VacuumTube"
flatpak "com.ranfdev.DistroShelf"
flatpak "org.gnome.Epiphany"
