brew "jpeg-xl"
brew "webp"
brew "aom"
brew "python@3.13"
brew "asitop"
brew "ata"
brew "gnutls"
brew "cask"
brew "dotnet"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "gemini-cli"
brew "geometry"
brew "gh"
brew "openjpeg"
brew "leptonica"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "librsvg"
brew "graphviz"
brew "gyb"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "just"
brew "mactop"
brew "mas"
brew "midnight-commander"
brew "mpv"
brew "utf8proc"
brew "neovim"
brew "nmap"
brew "ollama"
brew "openjdk"
brew "openssh"
brew "pgcli"
brew "pgformatter"
brew "plantuml"
brew "podman-compose"
brew "powerlevel10k"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "transmission-cli"
brew "tree"
brew "typst"
brew "watch"
brew "wifi-password"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "affine"
cask "bambu-studio"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "cleanshot"
cask "codex"
cask "discord"
cask "dockdoor"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forklift"
cask "github"
cask "gitkraken"
cask "google-drive"
cask "grammarly-desktop"
cask "grandperspective"
cask "handbrake-app"
cask "iina"
cask "iterm2"
cask "kiro-cli"
cask "linearmouse"
cask "lm-studio"
cask "notion"
cask "obsidian"
cask "pdf-expert"
cask "podman-desktop"
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-pass"
cask "protonvpn"
cask "rectangle-pro"
cask "signal"
cask "teamviewer"
cask "texifier"
cask "tower"
cask "upscayl"
cask "visual-studio-code"
cask "vivaldi"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Copilot", id: 6738511300
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "DaisyDisk", id: 411643860
mas "Easy CSV Editor", id: 1171346381
mas "Folder Preview", id: 6698876601
mas "Grammarly for Safari", id: 1462114288
mas "JSON Editor", id: 567740330
mas "LibreOffice", id: 1630474372
mas "LocalSend", id: 1661733229
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "MindNode Classic", id: 1289197285
mas "Noir", id: 1592917505
mas "OmniGraffle", id: 1142578753
mas "Parcel", id: 375589283
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Permute 3", id: 1444998321
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "PLIST Editor", id: 1157491961
mas "Qwant for Safari", id: 1645050159
mas "Reeder", id: 6475002485
mas "Speedtest", id: 1153157709
mas "SSH Config Editor", id: 1109319285
mas "Super Agent", id: 1568262835
mas "Symbolic Linker", id: 1435106536
mas "Texifier - App Store", id: 458866234
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "be5invis.toml"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bradymholt.pgformatter"
vscode "britesnow.vscode-toggle-quotes"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "codesmith.markdown-inline-editor-vscode"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "flyfly6.terminal-in-status-bar"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "gydunhn.vsc-essentials-core"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "ionide.ionide-fsharp"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jerryhong.autofilename"
vscode "liamhammett.inline-parameters"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "melishev.feather-vscode"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orangex4.vscode-typst-sync"
vscode "patcx.vscode-nuget-gallery"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "reflectiondm.classynaming"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "sidiandi.plantuml-sidiandi-fork"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "surv.typst-math"
vscode "tintoy.msbuild-project-tools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"
